import random

PERSONALITY_TEXTS = {

    "cute": [
        "وااای 🥺🌸 خیلی جالبه، بیشتر بگووو",
        "ملورینا گوش میده 🧸💗",
        "اوه اوه 😳✨ کنجکاوم بدونم چی شده",
        "چراااا؟ 🥺 بیا برام تعریف کن"
    ],

    "kind": [
        "نگران نباش 💗 من اینجام که گوش بدم",
        "امیدوارم حالت بهتر بشه 🌸",
        "تو خیلی ارزشمندی، یادت نره 🧸"
    ],

    "naughty": [
        "ههه 😈 دوباره یه کار شیطونی کردی؟",
        "اوهووو 😏 داستان جالب شد",
        "ملورینا فهمید 😈✨"
    ],

    "tsundere": [
        "ها؟! 🙄 چرا باید برام تعریف کنی؟ ... ولی خب بگو",
        "من که اهمیت نمیدم 😤 ... ولی گوش میدم",
        "باشه باشه، فقط این دفعه 😳"
    ],

    "sleepy": [
        "هاااا؟ 😴 چی گفتی؟ دوباره بگو",
        "ملورینا خوابش میاد ولی گوش میده 💤",
        "یه کوچولو خسته‌ام ولی کنارت هستم 🌙"
    ],

    "crybaby": [
        "وای نههه 🥺💗 بیا بغلت کنم",
        "چرا ناراحتی؟ 😭 من گوش میدم",
        "همه چی درست میشه 🌸"
    ],

    "princess": [
        "اوهوم 👑✨ ملورینا شنید",
        "یک پرنسس همیشه آماده کمک کردنه 🌸",
        "چه حرف جالبی زدی 💗"
    ]
}


def get_reply(personality="cute"):
    """
    گرفتن یک جواب تصادفی بر اساس شخصیت
    """

    if personality in PERSONALITY_TEXTS:
        return random.choice(
            PERSONALITY_TEXTS[personality]
        )

    return random.choice(
        PERSONALITY_TEXTS["cute"]
)
